Catalogs/Спецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Спецификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСпецификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>#12082 отключена проверка заполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬ_ПорядокОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругленияЧислом</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФиксированноеКоличество</Name>
							<Comment>#88</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СпецификацияПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СопутствующиеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплектация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Спецификации/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьЗначенияПоНастройкамФормы();
	Элементы.ПоказыватьСостав.Пометка = ПоказыватьСостав;
	Элементы.СоставСпецификации.Видимость = ПоказыватьСостав;
	
	//#12667 кнопку делаем доступной толко при открытии через кнопки "Перейти" карточки "Номенклатуры"
	ВидСпецификацииОпределен = Параметры.Отбор.Свойство("ВидСпецификации") И ЗначениеЗаполнено(Параметры.Отбор.ВидСпецификации);
	Элементы.ФормаОсновнаяСпецификация.Доступность = ВидСпецификацииОпределен;
	Если ВидСпецификацииОпределен Тогда
		Заголовок = Параметры.Отбор.ВидСпецификации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройкиФормыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "СохранениеСпецификации" И Источник = "СпецификацияФорма" Тогда
		СделатьЕдинственнуюСпецификациюОсновной(Параметр);
		Оповестить("ИзмениласьОсновнаяСпецификация",Параметр.Владелец,"СпецификацииНоменклатуры"); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийСписка

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПоказыватьСостав Тогда
		ДанныеСпецификации = ПолучитьДанныеСпецификации(ТекущиеДанные.Ссылка);
		СоставСпецификации.Очистить();
		Для каждого СтрокаТЗ из ДанныеСпецификации.Состав Цикл
			НоваяСтрока = СоставСпецификации.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура ОсновнаяСпецификация(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнаяСпецификацияНаСервере(ТекущиеДанные.Ссылка, ТекущиеДанные.Владелец, ТекущиеДанные.ВидСпецификации, Истина);
	Элементы.Список.Обновить();
	Оповестить("ИзмениласьОсновнаяСпецификация",,"СпецификацииНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСостав(Команда)
	
	ПоказыватьСостав = НЕ ПоказыватьСостав;
	Элементы.ПоказыватьСостав.Пометка = ПоказыватьСостав;
	Элементы.СоставСпецификации.Видимость = ПоказыватьСостав;
	
	Если ПоказыватьСостав Тогда 
		ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	Иначе
		СоставСпецификации.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()
	
	НастройкиФормы = НастройкиФормы();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Справочник_Спецификации", "", НастройкиФормы);
	
КонецПроцедуры

&НаСервере
Функция НастройкиФормы()
	
	НастройкиФормы = Новый Структура;	
	НастройкиФормы.Вставить("ПоказыватьСостав", ПоказыватьСостав);	
	Возврат НастройкиФормы;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначенияПоНастройкамФормы();
	// Если есть сохраненные настройки, то установить значения по настройкам.
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Справочник_Спецификации",  "");
	
	Если Настройки <> Неопределено Тогда
		
		Если Настройки.Свойство("ПоказыватьСостав") Тогда
			ПоказыватьСостав = Настройки.ПоказыватьСостав;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСпецификации(СпецификацияСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СпецификацияСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпецификацииСостав.Номенклатура КАК Номенклатура,
	|	СпецификацииСостав.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СпецификацииСостав.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СпецификацииСостав.Коэффициент КАК Коэффициент,
	|	СпецификацииСостав.Количество КАК Количество,
	|	СпецификацииСостав.ОкруглятьВБольшуюСторону КАК ОкруглятьВБольшуюСторону,
	|	СпецификацииСостав.ПорядокОкругленияЧислом КАК ПорядокОкругленияЧислом,
	|	СпецификацииСостав.ФиксированноеКоличество КАК ФиксированноеКоличество
	|ИЗ
	|	Справочник.Спецификации.Состав КАК СпецификацииСостав
	|ГДЕ
	|	СпецификацииСостав.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпецификацииСостав.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Структура;
	Результат.Вставить("Состав", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса.Выгрузить()));
	
	Возврат Результат;	
	
КонецФункции

&НаСервере
Процедура ОсновнаяСпецификацияНаСервере(СпецификацияСсылка, НоменклатураСсылка, ВидСпецификации, СбросСпецификации)
	
	//#12667
	ИмяРеквизитаОС = "";
	Если ВидСпецификации = Перечисления.ВидыСпецификации.СпецификацияПродукции Тогда
		ИмяРеквизитаОС = "ОсновнаяСпецификация";
	ИначеЕсли ВидСпецификации = Перечисления.ВидыСпецификации.СопутствующиеМатериалы Тогда
		ИмяРеквизитаОС = "ОсновнаяСпецификацияСопутствующиеМатериалы";
	ИначеЕсли ВидСпецификации = Перечисления.ВидыСпецификации.Комплектация Тогда
		ИмяРеквизитаОС = "ОсновнаяСпецификацияКомплектация";
	КонецЕсли;
	Если ПустаяСтрока(ИмяРеквизитаОС) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СпрОбъект = НоменклатураСсылка.ПолучитьОбъект();
		СпрОбъектМодифицирован = Ложь;
		Если НЕ СпрОбъект[ИмяРеквизитаОС] = СпецификацияСсылка Тогда
			СпрОбъект[ИмяРеквизитаОС] = СпецификацияСсылка;
			СпрОбъектМодифицирован = Истина;
		Иначе
			Если СбросСпецификации Тогда
				// нажали кнопку "Основная" на основной спецификации - снимаем признак
				СпрОбъект[ИмяРеквизитаОС] = Справочники.Спецификации.ПустаяСсылка();
				СпрОбъектМодифицирован = Истина;
			КонецЕсли;
		КонецЕсли;
		Если СпрОбъектМодифицирован Тогда
			СпрОбъект.Записать();
		КонецЕсли;
	Исключение
		Сообщить("Ошибка смены основной спецификации: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СделатьЕдинственнуюСпецификациюОсновной(СтруктураСсылки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Спецификации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Спецификации КАК Спецификации
	|ГДЕ
	|	Спецификации.Владелец = &Владелец
	|	И Спецификации.ВидСпецификации = &ВидСпецификации";
	Запрос.УстановитьПараметр("Владелец", СтруктураСсылки.Владелец);
	Запрос.УстановитьПараметр("ВидСпецификации", СтруктураСсылки.ВидСпецификации); //#12667
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультата.Количество() = 1 Тогда
		ОсновнаяСпецификацияНаСервере(ТаблицаРезультата[0].Ссылка, СтруктураСсылки.Владелец, СтруктураСсылки.ВидСпецификации, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
